john_coote/week_10/day_02/fruistore/app/controllers/fruits_controller.rb

  def index
    @fruits = Fruit.order('id DESC') # Reverse order
---
SELECT "fruits".* FROM "fruits" ORDER BY id DESC

  def create
    @fruit = Fruit.new fruit_params
    if @fruit.save
---
INSERT INTO "fruits" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2018-01-09 02:01:08.858214"], ["updated_at", "2018-01-09 02:01:08.858214"], ["name", "Strawberry"]]