john_coote/week_08/day_02/client_server/secrets_server/app/controllers/secrets_controller.rb

SELECT "secrets".* FROM "secrets"
---
  def index
    @secrets = Secret.all.reverse

INSERT INTO "secrets" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "guilty pleasure"], ["created_at", "2017-12-11 23:27:38.408713"], ["updated_at", "2017-12-11 23:27:38.408713"]]
---
  def create
    @secret = Secret.new(secret_params)

    respond_to do |format|
      if @secret.save

DELETE FROM "secrets" WHERE "secrets"."id" = ?  [["id", 1]]
---
  def destroy
    @secret.destroy

SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_secret
      @secret = Secret.find(params[:id])